Autodesk.Revit.DB.Structure.Rebar.ResetMovedBarTransform(System.Int32)
Reset the transformation representing the movement of the bar relative to its default position along the distribution path.
The moved bar transform will be set to Identity.
barPositionIndex:
The bar index.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2022

Autodesk.Revit.DB.Structure.Rebar.MoveBarInSet(System.Int32,Autodesk.Revit.DB.Transform)
This method applies the transformation matrix to the rebar bar at the desired position in the rebar set.
If the bar was already moved, the method will concatenate the transformation matrix with the existing movement.
barPositionIndex:
The bar index of the rebar to apply the transformation.
moveTransform:
The transformation matrix to apply to the specified rebar bar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2022

Autodesk.Revit.DB.Structure.Rebar.SetBarIncluded(System.Boolean,System.Int32)
Sets if the bar at the desired index is included or not.
include:
True to include the bar, false to exclude the bar.
barPositionIndex:
The bar index.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2022

Autodesk.Revit.DB.Structure.Rebar.SetPresentationMode(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Structure.RebarPresentationMode)
Sets the presentation mode for this rebar set when displayed in the given view.
dBView:
The view.
presentationMode:
The presentation mode.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This rebar cannot have a presentation mode applied for dBView, as the view is not valid for rebar presentation,
or the orientation of the view matches the normal direction of the rebar element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2015

Autodesk.Revit.DB.Structure.Rebar.SetBarHiddenStatus(Autodesk.Revit.DB.View,System.Int32,System.Boolean)
Sets the bar in this rebar set to be hidden or unhidden in the given view.
Remarks:
Individual bars of a rebar set can be hidden in a view only
if the presentation mode is RebarPresentationMode.Select.
If that is not the presentation mode assigned for this set in the view,
this method will also change it.
view:
The view.
barIndex:
The index of the bar from this set.
hide:
True to hide this bar in the view, false to unhide the bar.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This rebar cannot have a presentation mode applied for view, as the view is not valid for rebar presentation,
or the orientation of the view matches the normal direction of the rebar element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2015

Autodesk.Revit.DB.Structure.Rebar.IsRebarInSection(Autodesk.Revit.DB.View)
Identifies if this Rebar is shown as a cross-section in the given view.
dBView:
The view.
Returns:
True if this Rebar is shown as a cross-section, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Structure.Rebar.SetEndTreatmentTypeId(System.Int32,Autodesk.Revit.DB.ElementId)
Sets the id of the EndTreatmentType to be applied to the rebar.
This can be done if and only if the end of the bar on which the end treatment is applied has no RebarCoupler on it, otherwise will throw an exception.
If a RebarHookType is present at the rebar end, it will automatically set to invalidElementId.
end:
0 for the start end treatment, 1 for the end end treatment.
endTreatmentTypeId:
The id of a EndTreatmentType element, or invalidElementId if
the rebar should have no end treatment at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the parameter endTreatmentTypeId is not an EndTreatmentType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the Rebar end end has a RebarCoupler on it.
Since:
2021

Autodesk.Revit.DB.Structure.Rebar.SetHookTypeId(System.Int32,Autodesk.Revit.DB.ElementId)
Set the id of the RebarHookType to be applied to the rebar.
If an EndTreatmentType is present at the rebar end, it will automatically set to invalidElementId.
end:
0 for the start hook, 1 for the end hook.
hookTypeId:
The id of a RebarHookType element, or invalidElementId if
the rebar should have no hook at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookTypeId is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SetSolidInView(Autodesk.Revit.DB.View3D,System.Boolean)
Sets this rebar element to be shown solidly in a 3D view.
view:
The 3D view element
solid:
True if rebar is shown solidly, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element doesn't have valid visibility data.
Since:
2011

Autodesk.Revit.DB.Structure.Rebar.IsSolidInView(Autodesk.Revit.DB.View3D)
Checks if this rebar element is shown solidly in a 3D view.
view:
The 3D view element
Returns:
True if rebar is shown solidly, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element doesn't have valid visibility data.
Since:
2011

Autodesk.Revit.DB.Structure.Rebar.SetUnobscuredInView(Autodesk.Revit.DB.View,System.Boolean)
Sets this rebar element to be shown unobscured in a view.
view:
The view element
unobscured:
True if rebar is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element doesn't have valid visibility data.
Since:
2011

Autodesk.Revit.DB.Structure.Rebar.SetHostId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
The element that contains the rebar.
doc:
The document containing both this element and the host element.
hostId:
The element that the rebar object belongs to, such as a structural
wall, floor, foundation, beam, brace or column. The rebar does not need
to be strictly inside the host, but it must be assigned to one host
element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
hostId is not a legal Rebar host (see the RebarHostData class).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.CreateFromCurvesAndShape(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Double,System.Double,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of a shape driven Rebar element within the project.
The instance will have the default shape parameters from the RebarShape.
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to true,
then curves, hook types and hook rotation angles should match the rebar shape definition.
Otherwise, the hooks can be different than the defaults specified in the RebarShape.
If the RebarShapeDefinesEndTreatment flag in ReinforcementSettings has been set to true,
then curves and end treatment types should match the rebar shape definition.
Otherwise, the end treatment types can be different than the defaults specified in the RebarShape.
doc:
A document.
rebarShape:
A RebarShape element that defines the shape of the rebar.
A RebarShape element that matches curves, hooks, hook rotation angles and End Treatment.
A RebarShape element that provides the RebarStyle of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
host:
The element to which the rebar belongs. The element must support rebar hosting;
Autodesk::Revit::DB::Structure::RebarHostData.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
hookRotationAngleAtStart:
The out of plane hook rotation angle at the start of the bar.
hookRotationAngleAtEnd:
The out of plane hook rotation angle at the end of the bar.
endTreatmentTypeIdAtStart:
The end treatment type id at the start of the bar.
endTreatmentTypeIdAtEnd:
The end treatment type id at the end of the bar.
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
-or-
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
-or-
the parameter endTreatmentTypeIdAtStart is not an EndTreatmentType element.
-or-
the parameter endTreatmentTypeIdAtEnd is not an EndTreatmentType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and RebarShape style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rebarShape does not match curves.
Since:
2021

Autodesk.Revit.DB.Structure.Rebar.CreateFromCurvesAndShape(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation)
Creates a new instance of a shape driven Rebar element within the project.
The instance will have the default shape parameters from the RebarShape.
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to true,
then both the curves and hooks must match the RebarShape definition.
Otherwise, the hooks can be different than the defaults specified in the RebarShape
doc:
A document.
rebarShape:
A RebarShape element that defines the shape of the rebar.
A RebarShape element matches curves and hooks.
A RebarShape element provides RebarStyle of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
host:
The element to which the rebar belongs. The element must support rebar hosting;
Autodesk::Revit::DB::Structure::RebarHostData.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
-or-
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and RebarShape style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rebarShape does not match curves.
Since:
2013

Autodesk.Revit.DB.Structure.Rebar.CreateFromRebarShape(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new shape driven Rebar, as an instance of a RebarShape.
The instance will have the default shape parameters from the RebarShape,
and its location is based on the bounding box of the shape in the shape definition.
Hooks are removed from the shape before computing its bounding box.
If appropriate hooks can be found in the document, they will be assigned arbitrarily.
doc:
A document.
rebarShape:
A RebarShape element that defines the shape of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting;
Autodesk::Revit::DB::Structure::RebarHostData.
origin:
The lower-left corner of the shape's bounding box will be placed at this point in the project.
xVec:
The x-axis in the shape definition will be mapped to this direction in the project.
yVec:
The y-axis in the shape definition will be mapped to this direction in the project.
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xVec has zero length.
-or-
yVec has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.CreateFromCurves(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Double,System.Double,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean,System.Boolean)
Creates a new instance of a shape driven Rebar element within the project.
doc:
A document.
style:
The usage of the bar, "standard" or "stirrup/tie".
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
host:
The element to which the rebar belongs. The element must support rebar hosting;
Autodesk::Revit::DB::Structure::RebarHostData.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
hookRotationAngleAtStart:
The out of plane hook rotation angle at the start of the bar.
hookRotationAngleAtEnd:
The out of plane hook rotation angle at the end of the bar.
endTreatmentTypeIdAtStart:
The end treatment type id at the start of the bar.
endTreatmentTypeIdAtEnd:
The end treatment type id at the end of the bar.
useExistingShapeIfPossible:
Attempts to assign a RebarShape from those existing in the document. If no shape matches, this function returns null if createNewShape is false or it will create a new shape if createNewShape is true.
When both parameters are "true", the behavior is the same as sketching rebar in the UI. At least one of these parameters must be "true".
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, and a RebarShape cannot be found with both matching curves and hooks,
then this method will perform a second search, ignoring hook information.
createNewShape:
Creates a shape in the document to match the curves, hooks, and style specified, and assigns it to the new rebar instance.
Shape creation will not succeed unless one or more other shapes already exist in the document, and these shapes
have enough shape parameters to define a shape for these curves.
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
-or-
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
-or-
the parameter endTreatmentTypeIdAtStart is not an EndTreatmentType element.
-or-
the parameter endTreatmentTypeIdAtEnd is not an EndTreatmentType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Both useExistingShapeIfPossible and createNewShape are false.
-or-
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and bar style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2021

Autodesk.Revit.DB.Structure.Rebar.CreateFromCurves(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Boolean,System.Boolean)
Creates a new instance of a shape driven Rebar element within the project.
doc:
A document.
style:
The usage of the bar, "standard" or "stirrup/tie".
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
host:
The element to which the rebar belongs. The element must support rebar hosting;
Autodesk::Revit::DB::Structure::RebarHostData.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
useExistingShapeIfPossible:
Attempts to assign a RebarShape from those existing in the document. If no shape matches, this function returns null if createNewShape is false or it will create a new shape if createNewShape is true.
When both parameters are "true", the behavior is the same as sketching rebar in the UI. At least one of these parameters must be "true".
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, and a RebarShape cannot be found with both matching curves and hooks,
then this method will perform a second search, ignoring hook information.
createNewShape:
Creates a shape in the document to match the curves, hooks, and style specified, and assigns it to the new rebar instance.
Shape creation will not succeed unless one or more other shapes already exist in the document, and these shapes
have enough shape parameters to define a shape for these curves.
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
-or-
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Both useExistingShapeIfPossible and createNewShape are false.
-or-
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and bar style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.CreateFreeForm(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult@)
Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar.
Remarks:
This function can fail due to following reasons:
The array of CurveLoops is empty.
At least one CurveLoop is empty.
At least one CurveLoop contains an unbounded curve.
A rebar constructed from curves can't be bent according to the bending radius.
doc:
A document.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting.
curves:
Each curve loop represents a bar in the set.
error:
Will be Success(0) if everything is ok, otherwise the failure reason.
Returns:
The newly created free form Rebar Instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
host is not a valid rebar host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2018

Autodesk.Revit.DB.Structure.Rebar.CreateFreeForm(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element,System.Collections.Generic.IList{System.Collections.Generic.IList{Autodesk.Revit.DB.Curve}},Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult@)
Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar.
Remarks:
This function can fail due to following reasons:
One or more of the input curves was null.
One or more of the input curves was unbounded.
Curves doesn't form a valid curve loop, it forms 0, 2 or more curve loops.
A rebar constructed from curves can't be bent according to the bending radius.
doc:
A document.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting.
curves:
Each array of curves represent a bar in the set.
error:
Will be Success if everything is ok, otherwise the failure reason.
Returns:
The newly created free form Rebar Instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
host is not a valid rebar host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2018

Autodesk.Revit.DB.Structure.Rebar.CreateFreeForm(Autodesk.Revit.DB.Document,System.Guid,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element)
Creates a free form rebar that can have constraints.
Remarks:
It requires a server GUID which will have the responsibility to define bar handles(which will be constrained) and to do the calculation of the curves.
See Autodesk.Revit.DB.Structure.IRebarUpdateServer for more details.
doc:
A Document.
serverGUID:
The API server GUID.
Should be the same that the function GetServerId() from class derived from Autodesk.Revit.DB.Structure.IRebarUpdateServer returns.
This server has the responsibility to calculate the bars of Rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting.
Returns:
The newly created free form Rebar Instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
host is not a valid rebar host.
-or-
The server with serverGUID was not registered for RebarUpdateService.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2018

Autodesk.Revit.DB.Structure.Rebar.NumberOfBarPositions
The number of potential bars in the set.
Remarks:
The number of positions is equal to the number of actual bars (the Quantity), plus the number of bars that are excluded.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: the number of bar positions numberOfBarPositions is less than 1 or more than 1002.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: This rebar element represents a single bar (the layout rule is Single).
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.ScheduleMark
The Schedule Mark parameter. On creation, the Schedule Mark is set
to a value that is unique to the host, but it can be set to
any value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013